---
kind: type
id: T:Autodesk.Revit.Exceptions.CentralModelException
source: html/0e2ac15f-ca64-42c3-b3ef-e6f7ca1cb59a.htm
---
# Autodesk.Revit.Exceptions.CentralModelException

The base class for exceptions that are
common to both file-based and server-based central models or
specific to just file-based central models.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CentralModelException : ApplicationException
```